tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "dbcli/tap"

brew "asdf"
brew "gh"
brew "htop"
brew "bat"
brew "neovim"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "lua-language-server"
brew "pgcli"

cask "kitty"
cask "android-studio"
cask "authy"
cask "bitwarden"
cask "discord"
cask "docker"
cask "figma"
cask "flycut"
cask "notion"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "spotify"
cask "font-jetbrains-mono"
cask "insomnia"
