tap "getsentry/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "coreutils"
brew "asdf"
brew "glib"
brew "pkg-config"
brew "at-spi2-core"
brew "bat"
brew "icu4c", link: true
brew "xz"
brew "cairomm"
brew "cmake"
brew "cocoapods"
brew "fd"
brew "fwup"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "gtk+"
brew "gtk+3"
brew "gtk4"
brew "gtkmm"
brew "gtkmm3"
brew "gtkmm4"
brew "htop"
brew "jpeg"
brew "jq"
brew "librsync"
brew "little-cms2"
brew "neovim"
brew "openjdk"
brew "pgcli"
brew "redis"
brew "ripgrep"
brew "speedtest-cli"
brew "sphinx-doc"
brew "spotify-tui"
brew "squashfs"
brew "stow"
brew "stylua"
brew "watchman"
brew "webp"
brew "openjdk"
brew "maven"

cask "1password"
cask "1password-cli"
cask "android-studio"
cask "arc"
cask "authy"
cask "aws-vpn-client"
cask "bitwarden"
cask "discord"
cask "docker"
cask "figma"
cask "flipper"
cask "flycut"
cask "font-jetbrains-mono"
cask "insomnia"
cask "kitty"
cask "notion"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tableplus"
cask "wireshark"
