tap "homebrew/bundle"

brew "coreutils"
brew "asdf"
brew "cmake"
brew "cocoapods"
brew "fzf"
brew "gh"
brew "htop"
brew "jpeg"
brew "jq"
brew "neovim"
brew "openjdk"
brew "pgcli"
brew "redis"
brew "ripgrep"
brew "speedtest-cli"
brew "stow"
brew "stylua"
brew "watchman"
brew "webp"
brew "maven"
brew "git-delta"

cask "android-studio"
cask "arc"
cask "authy"
cask "bitwarden"
cask "discord"
cask "docker"
cask "flycut"
cask "insomnia"
cask "alacritty"
cask "notion"
cask "obsidian"
cask "rectangle"
cask "slack"
